; domain
(define (domain logistics)

  (:requirements :strips :typing)

  (:types
        physobj location - object
        robot gold_mine - physobj
        tiles - location
  )

  (:predicates
		(at ?obj - physobj ?loc - location)
		(right ?loc-from - location ?loc-to - location)
		(left ?loc-from - location ?loc-to - location)
		(up ?loc-from - location ?loc-to - location)
		(down ?loc-from - location ?loc-to - location)
		(has_gold)
  )


 (:action right
    :parameters (?b - robot ?loc-from - location ?loc-to - location)
    :precondition (and (at ?b ?loc-from) (right ?loc-from ?loc-to))
    :effect (and (not (at ?b ?loc-from)) (at ?b ?loc-to))
 )

 (:action left
    :parameters (?b - robot ?loc-from - location ?loc-to - location)
    :precondition (and (at ?b ?loc-from) (left ?loc-from ?loc-to))
    :effect (and (not (at ?b ?loc-from)) (at ?b ?loc-to))
 )

 (:action down
    :parameters (?b - robot ?loc-from - location ?loc-to - location)
    :precondition (and (at ?b ?loc-from) (down ?loc-from ?loc-to))
    :effect (and (not (at ?b ?loc-from)) (at ?b ?loc-to))
 )

 (:action up
    :parameters (?b - robot ?loc-from - location ?loc-to - location)
    :precondition (and (at ?b ?loc-from) (up ?loc-from ?loc-to))
    :effect (and (not (at ?b ?loc-from)) (at ?b ?loc-to))
 )

 (:action dig
    :parameters (?b - robot ?loc-from - location )
    :precondition (and (at ?b ?loc-from) (at g ?loc-from ))
    :effect (has_gold)
 )
)

; problem
(define (problem pb_logistics)
  (:domain logistics)

  (:objects
     b - robot
     g - gold_mine
     loc_1_1 loc_1_2 loc_1_3 - tiles
     loc_2_1 loc_2_2 loc_2_3 - tiles
     loc_3_1 loc_3_2 loc_3_3 - tiles
  )

  (:init
        (at b loc_1_1)
        (at g loc_3_3)

        (right loc_1_1 loc_1_2)
        (right loc_2_1 loc_2_2)
        (right loc_3_1 loc_3_2)
        (right loc_1_2 loc_1_3)
        (right loc_2_2 loc_2_3)
        (right loc_3_2 loc_3_3)


        (left loc_1_2 loc_1_1)
        (left loc_2_2 loc_2_1)
        (left loc_3_2 loc_3_1)
        (left loc_1_3 loc_1_2)
        (left loc_2_3 loc_2_2)
        (left loc_3_3 loc_3_2)

        (down loc_1_1 loc_2_1)
        (down loc_1_2 loc_2_2)
        (down loc_1_3 loc_2_3)
        (down loc_2_1 loc_3_1)
        (down loc_2_2 loc_3_2)
        (down loc_2_3 loc_3_3)

        (up loc_2_1 loc_1_1)
        (up loc_2_2 loc_1_2)
        (up loc_2_3 loc_1_3)
        (up loc_3_1 loc_2_1)
        (up loc_3_2 loc_2_2)
        (up loc_3_3 loc_2_3)
  )

  (:goal
        (and (at b loc_1_1) (has_gold))
  )
)

; plan
1. (right b loc_1_1 loc_1_2)
   deleted: (at b loc_1_1)
   added: (at b loc_1_2)
   goals met: 0 of 2
2. (right b loc_1_2 loc_1_3)
   deleted: (at b loc_1_2)
   added: (at b loc_1_3)
   goals met: 0 of 2
3. (down b loc_1_3 loc_2_3)
   deleted: (at b loc_1_3)
   added: (at b loc_2_3)
   goals met: 0 of 2
4. (down b loc_2_3 loc_3_3)
   deleted: (at b loc_2_3)
   added: (at b loc_3_3)
   goals met: 0 of 2
5. (dig b loc_3_3)
   added: (has_gold)
   goals met: 1 of 2
6. (left b loc_3_3 loc_3_2)
   deleted: (at b loc_3_3)
   added: (at b loc_3_2)
   goals met: 1 of 2
7. (left b loc_3_2 loc_3_1)
   deleted: (at b loc_3_2)
   added: (at b loc_3_1)
   goals met: 1 of 2
8. (up b loc_3_1 loc_2_1)
   deleted: (at b loc_3_1)
   added: (at b loc_2_1)
   goals met: 1 of 2
9. (up b loc_2_1 loc_1_1)
   deleted: (at b loc_2_1)
   added: (at b loc_1_1)
   goals met: 2 of 2
